In [1]:
import pandas as pd
import numpy as np

d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
     'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [2]:
df = pd.DataFrame(d) # use caps...

In [3]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [4]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [7]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

AttributeError: type object 'object' has no attribute 'dtype'

In [6]:
d = {'one': [1., 2., 3., 4.],
         'two': [4., 3., 2., 1.]}

In [8]:
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [9]:
pd.DataFrame(d, index=["a","b","c","d"]) # change index names

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [10]:
# or from a series
pd.DataFrame(pd.Series(np.random.randn(5), name='something'))

   something
0  -1.846350
1   1.238948
2   1.591464
3  -0.531502
4  -0.679535

In [11]:
df["one"]

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [13]:
df["three"] = df["one"] * df["two"]
df

   one  two  three
a  1.0  1.0    1.0
b  2.0  2.0    4.0
c  3.0  3.0    9.0
d  NaN  4.0    NaN

In [18]:
# del df["two"] # I ran it twice, so two doesn't exist anymore lol

In [19]:
df

   one  three
a  1.0    1.0
b  2.0    4.0
c  3.0    9.0
d  NaN    NaN

In [22]:
df["foo"] = "bar" # add a column easily
df

   one  three  foo
a  1.0    1.0  bar
b  2.0    4.0  bar
c  3.0    9.0  bar
d  NaN    NaN  bar

In [24]:
df["one_trunc"] = df["one"][:2] # copying up to an index...
df

   one  three  foo  one_trunc
a  1.0    1.0  bar        1.0
b  2.0    4.0  bar        2.0
c  3.0    9.0  bar        NaN
d  NaN    NaN  bar        NaN

In [31]:
# new df!
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=list('ABC'))

NameError: name 'index' is not defined

In [ ]:
df * 5 + 2

In [ ]:
1 / df

In [ ]:
df ** 4

In [33]:
df1 = pd.DataFrame({'a': [1, 0, 1], 'b': [0, 1, 1]}, dtype=bool)
df2 = pd.DataFrame({'a': [0, 1, 1], 'b': [1, 1, 0]}, dtype=bool)

In [34]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [35]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [36]:
df1 ^ df2

       a      b
0   True   True
1   True  False
2  False   True

In [37]:
-df1

       a      b
0  False   True
1   True  False
2  False  False